WELCOME_MSG = (
    'Привет, я бот онлайн школы GoodStart!\n\n'
    'Здесь ты найдёшь лучших преподавателей.'
)

APPLICATION_EXISTS_MSG = (
    'Вы уже сформировали заявку на регистрацию.\n\n'
    'Если заявка обрабатывается долго, пожалуйста, '
    'свяжитесь с нашим администратором для скорейшего '
    'решения этого вопроса.\n\n'
    'Благодарим за терпение!'
)

REGISTRATION_MSG = (
    'Привет, я бот онлайн школы GoodStart!\n\n'
    'Похоже, ты еще не зарегистрирован в нашей онлайн школе '
    'GoodStart.\nДавай зарегистрируемся прямо сейчас!'
)

REGISTRATION_SUCCESS_MSG = (
    'Заявка успешно создана и отправлена!\n'
    'Наш администратор свяжется с Вами по указанному номеру телефона.\n\n'
    'В ближайшее время Вам будут доступны все функции бота, спасибо.'
)

UNKNOWN_USER_HELP_MSG = (
    'Чтобы воспользоваться всеми преимуществами бота,\n'
    'необходимо заполнить форму регистрации и дождаться подтверждения '
    'от нашего менеджера.\n\n'
    'Если вдруг возникли какие-то вопросы, обязательно свяжись с нами.\n\n'
    'С наилучшими пожеланиями, команда школы GoodStart!'
)

TEACHER_HELP_MSG = (
    'Список доступных команд:\n\n'
    '/start - отправная точка и главное меню преподавателя.\n'
    '/schedule - открыть страницу с расписанием занятий на неделю.\n'
    '/help - отображает справку по всем доступным командам бота.\n'
    '/feedback - написать обращение администратору.\n'
)

STUDENT_HELP_MSG = (
    'Список доступных команд:\n\n'
    '/start - отправная точка и главное меню ученика.\n'
    '/schedule - открыть страницу с расписанием занятий на неделю.\n'
    '/help - отображает справку по всем доступным командам бота.\n'
    '/feedback - написать обращение администратору.\n'
)

FAREWELL_TEACHER_MESSAGE = (
    'Спасибо, что пользовались услугами нашей школы.\n\n'
    'Благодарим за Ваш вклад в образование!'
)

FAREWELL_STUDENT_MESSAGE = (
    'Спасибо, что пользовались услугами нашей школы.\n\n'
    'Мы всегда рады успеху наших учеников!'
)

FEEDBACK_SUBJECT_REQUEST_MSG = (
    'Пожалуйста, напишите ТЕМУ обращения'
)

FEEDBACK_SUBJECT_REQUEST_MSG_ERROR = (
    'У вас нет доступа к этой команде..\n\n'
    'Пожалуйста, воспользуйтесь командой /start и отправьте данные для '
    'регистрации - с Вами свяжется наш администратор.\n\n'
    'Если по какой-то причине Вашу заявку ещё не подтвердили, обратитесь '
    'к администратору для скорейшего решения ситуации.'
)

FEEDBACK_BODY_REQUEST_MSG = (
    'Теперь напишите более подробно, чтобы наша команда как можно быстрее '
    'смогла предпринять действия по Вашему обращению'
)

FEEDBACK_SUCCESS_MSG = (
    'Спасибо, сообщение успешно отправлено!'
)

FEEDBACK_REMOVE_SUPPORT_KEYBOARD_MSG = (
    'Спасибо! Следуйте подсказкам:'
)

UNCOMPLETED_LESSON_FEEDBACK_MSG = (
    'Пожалуйста, сообщите нам почему занятия не было, '
    'выбрав команду ниже.'
)

COMPLETED_LESSON_MSG = (
    'Занятие завершено.'
)

SUCCESS_LESSON_MSG = (
    'Ответ получен! Благодарим за обратную связь.'
)
