WELCOME_MSG = (
    'Привет, я бот онлайн школы GoodStart!\n\n'
    'Здесь ты найдёшь лучших преподавателей.'
)

APPLICATION_EXISTS_MSG = (
    'Вы уже сформировали заявку на регистрацию.\n\n'
    'Если заявка обрабатывается долго, пожалуйста, '
    'свяжитесь с нашим администратором для скорейшего '
    'решения этого вопроса.\n\n'
    'Благодарим за терпение!'
)

REGISTRATION_MSG = (
    'Привет, я бот онлайн школы GoodStart!\n\n'
    'Похоже, ты еще не зарегистрирован в нашей онлайн школе '
    'GoodStart.\nДавай зарегистрируемся прямо сейчас!'
)

REGISTRATION_SUCCESS_MSG = (
    'Заявка успешно создана и отправлена нашему администратору.\n\n'
    'В ближайшее время Вам будут доступны все функции бота, спасибо.'
)

UNKNOWN_USER_HELP_MSG = (
    'Чтобы воспользоваться всеми преимуществами бота,\n'
    'необходимо заполнить форму регистрации и дождаться подтверждения '
    'от нашего менеджера.\n\n'
    'Если вдруг возникли какие-то вопросы, обязательно свяжись с нами.\n\n'
    'С наилучшими пожеланиями, команда школы GoodStart!'
)

TEACHER_HELP_MSG = (
    'Список доступных команд:\n\n'
    '/start - отправная точка и главное меню преподавателя.\n'
    '/schedule - открыть страницу с расписанием занятий на неделю.\n'
    '/help - отображает справку по всем доступным командам бота.\n'
)

STUDENT_HELP_MSG = (
    'Список доступных команд:\n\n'
    '/start - отправная точка и главное меню ученика.\n'
    '/schedule - открыть страницу с расписанием занятий на неделю.\n'
    '/help - отображает справку по всем доступным командам бота.\n'
)
